OpenFOAM/kOmega_simple/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          | 
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         | 
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "./constant/geometry/combined.fms";

maxCellSize 0.5;

localRefinement
{   
    "riblet.*"
    {
        cellSize                    0.0025;
        refinementThickness         0.025;
    }
}

objectRefinements
{
    wake
    {
        type        box;
        cellSize    0.04;
        centre      (1.5 0 0);
        lengthX     6;
        lengthY     1;
        lengthZ     0.6;
    }

    farField
    {
        type        box;
        cellSize    0.02;
        centre      (1.5 0 0);
        lengthX     5.5;
        lengthY     0.8;
        lengthZ     0.6;
    }

    nearField
    {
        type        box;
        cellSize    0.01;
        centre      (1.5 0 0);
        lengthX     5.25;
        lengthY     0.6;
        lengthZ     0.4;
    }
}

boundaryLayers
{    
    patchBoundaryLayers
    {
        "riblet.*"
        {
            nLayers                 10;
            thicknessRatio          1.2;
            allowDiscontinuity      1;
        }
    }
    
    optimiseLayer       1;

    untangleLayers      0;

    optimisationParameters
    {

        nSmoothNormals      3;

        maxNumIterations    5;

        featureSizeFactor   0.4;

        reCalculateNormals  1;

        relThicknessTol     0.1;
    }
}

renameBoundary
{
    newPatchNames
    {
        "inlet.*"
        {
            newName inlet;
            type    patch;
        }

        "outlet.*"
        {
            newName outlet;
            type    patch;
        }

        "topAndBottom.*"
        {
            newName topAndBottom;
            type    wall;
        }

        "ribletTop"
        {
            newName ribletTop;
            type    wall;
        }
        
        "ribletBottom"
        {
            newName ribletBottom;
            type    wall;
        }

        "bottomEmptyFaces.*"
        {
            newName back;
            type    empty;
        }

        "topEmptyFaces.*"
        {
            newName front;
            type    empty;
        }
    }
}
// ************************************************************************* //