OpenFOAM/kOmega_simple/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


7
(
inlet
{
    type patch;
    nFaces 82;
    startFace 191451;
}

outlet
{
    type patch;
    nFaces 82;
    startFace 191533;
}

ribletBottom
{
    type wall;
    nFaces 571;
    startFace 191615;
}

ribletTop
{
    type wall;
    nFaces 571;
    startFace 192186;
}

topAndBottom
{
    type wall;
    nFaces 164;
    startFace 192757;
}

back
{
    type empty;
    nFaces 95454;
    startFace 192921;
}

front
{
    type empty;
    nFaces 95454;
    startFace 288375;
}

)


// ************************************************************************* //
