OpenFOAM/kOmega_simple/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type        zeroGradient;
    }

    outlet
    {
        type            fixedValue;
		value   		$internalField;
    }
    
    "riblet.*"
    {
        type            zeroGradient;
    }
	
    topAndBottom
    {
        type            slip;
    }
    
	front
	{
		type			empty;
	}
	
	back
	{
		type			empty;
	}
}

// ************************************************************************* //
